Autodesk.Revit.DB.IPDFParametersProviderProxy.OnPageSize(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.BoundingBoxUV)
Receiving the PDF page size, in PDF user space coordinates, which is the same as the PDF media box size.
viewId:
The ElementId of the view to be exported.
mediaBox:
The PDF page size for the view to be exported, in PDF user space coordinates.
Since:
2022

Autodesk.Revit.DB.IPDFParametersProviderProxy.ProvideParameter(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Transform)
Provide Tag and Properties for a PDF container's Marked Content of a Revit view region.
document:
The document which PDF exporter is exporting. And it should be the host document if there are links.
viewId:
The view id which PDF exporter is processing.
viewRegionIndex:
The index of the view region which PDF exporter is processing, starting from -1.
viewportId:
The viewport of the view region.
viewRegionTransform:
The "model to PDF page" transform of the view region.
Returns:
The parameter to the PDF container of the Revit element.
Since:
2022

Autodesk.Revit.DB.IPDFParametersProviderProxy.ProvideParameter(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Provide Tag and Properties for a PDF container's Marked Content of a Revit element.
document:
The document which PDF exporter is exporting. And it should be the host document if there are links.
elemId:
The ElementId of the element which PDF exporter is processing. It might be the ElementId of the linked document.
linkInstanceId:
The ElementId of the link instance which the element belongs to, or invalidElementId when the element belongs to the host document.
viewId:
The view id which the element belongs to.
Returns:
The parameter to the PDF container of the Revit element.
Since:
2022